src/test/resources/plays/multipayment/create_boleto.yaml

!play
interactions:
-
  request:
    uri: /v2/multiorders/MOR-F2R675R1X97P/multipayments
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"MPY-JMLVYS8CAQ4V","status":"WAITING","amount":{"total":8000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-12-14","lineCode":"23793.39126 60000.138614 46001.747909 8 73730000008000","logoUri":"https://cdn.moip.com.br/wp-content/uploads/2016/05/02163352/logo-moip.png","instructionLines":{"first":"Primeira linha de instrução","second":"Segunda linha de instrução","third":"Terceira linha de instrução"}},"method":"BOLETO"},"payments":[{"id":"PAY-GR8PGC25X1H4","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-12-14","lineCode":"23793.39126 60000.138614 46001.747909 8 73730000008000","logoUri":"https://cdn.moip.com.br/wp-content/uploads/2016/05/02163352/logo-moip.png","instructionLines":{"first":"Primeira linha se instrução","second":"Segunda linha se instrução","third":"Terceira linha se instrução"}},"method":"BOLETO"},"fees":[{"type":"TRANSACTION","amount":0}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-11-30T09:10:35.000-02"},{"type":"PAYMENT.WAITING","createdAt":"2017-11-30T09:10:35.000-02"}],"receivers":[{"moipAccount":{"id":"MPA-VB5OGTVPCI52","login":"lojista_1@labs.moip.com.br","fullname":"Chris Coyier Moip"},"type":"PRIMARY","amount":{"total":4000,"fees":0,"refunds":0},"feePayor":true}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-GR8PGC25X1H4"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-7ZX1THPTDBF0","title":"ORD-7ZX1THPTDBF0"}},"createdAt":"2017-11-30T09:10:35.000-02","updatedAt":"2017-11-30T09:10:35.000-02"},{"id":"PAY-L2U6CE1T9JVW","status":"WAITING","delayCapture":false,"amount":{"total":4000,"gross":4000,"fees":0,"refunds":0,"liquid":4000,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"boleto":{"expirationDate":"2017-12-14","lineCode":"23793.39126 60000.138614 46001.747909 8 73730000008000","logoUri":"https://cdn.moip.com.br/wp-content/uploads/2016/05/02163352/logo-moip.png","instructionLines":{"first":"Primeira linha se instrução","second":"Segunda linha se instrução","third":"Terceira linha se instrução"}},"method":"BOLETO"},"fees":[{"type":"TRANSACTION","amount":0}],"events":[{"type":"PAYMENT.CREATED","createdAt":"2017-11-30T09:10:35.000-02"},{"type":"PAYMENT.WAITING","createdAt":"2017-11-30T09:10:35.000-02"}],"receivers":[{"moipAccount":{"id":"MPA-IFYRB1HBL73Z","login":"lojista_3@labs.moip.com.br","fullname":"Lojista 3 Moip"},"type":"PRIMARY","amount":{"total":3945,"fees":0,"refunds":0},"feePayor":true},{"moipAccount":{"id":"MPA-KQB1QFWS6QNM","login":"secundario_1@labs.moip.com.br","fullname":"Maria da Silva Santos"},"type":"SECONDARY","amount":{"total":55,"fees":0,"refunds":0},"feePayor":false}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-L2U6CE1T9JVW"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-MPPFQYCAPGM2","title":"ORD-MPPFQYCAPGM2"}},"createdAt":"2017-11-30T09:10:35.000-02","updatedAt":"2017-11-30T09:10:35.000-02"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-JMLVYS8CAQ4V"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-1C4EG0VINAS1"},"checkout":{"payBoleto":{"printHref":"https://checkout-sandbox.moip.com.br/boleto/MPY-JMLVYS8CAQ4V/print","redirectHref":"https://checkout-sandbox.moip.com.br/boleto/MPY-JMLVYS8CAQ4V"}}}}